Revit 2027 API
FamilyUtils.GetProfileSymbols Method
 Gets the profile Family Symbols of the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ICollection<ElementId> GetProfileSymbols(
	Document document,
	ProfileFamilyUsage profileFamilyUsage,
	bool oneCurveLoopOnly
)
Public Shared Function GetProfileSymbols (
	document As Document,
	profileFamilyUsage As ProfileFamilyUsage,
	oneCurveLoopOnly As Boolean
) As ICollection(Of ElementId)
public:
static ICollection<ElementId^>^ GetProfileSymbols(
	Document^ document,
	ProfileFamilyUsage profileFamilyUsage,
	bool oneCurveLoopOnly
)
static member GetProfileSymbols :
        document : Document *
        profileFamilyUsage : ProfileFamilyUsage *
        oneCurveLoopOnly : bool -> ICollection<ElementId>
Parameters
document Document
 The document.
profileFamilyUsage ProfileFamilyUsage
 The profile family usage.
oneCurveLoopOnly Boolean
 Whether or not to return only profiles with one curve loop.
Return Value
ICollection<ElementId>
 The set of profile Family Symbol element ids.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
FamilyUtils Class
Autodesk.Revit.DB Namespace